#   1 2 3 4
# 1 1 1 1 1
# 2 2 3 4 5
# 3 3 6 10 15
# 4 4 10
# k=1일때, 답은 자기 자신밖에 없음
# n=2, k=2일떄, (2,0)x2 (1,1)
# k=3일떄, (2,0,0)x3 (1,1,0)(1,0,1)(0,1,1)
# k=4일떄, (2,0,0,0)x4 (1,1,0,0)(1,0,1,0)(1,0,0,1)(0,1,1,0)(0,1,0,1)(0,0,1,1)
# 흠... 1 - 3 - 6
# n=3, k=2일때, (3,0)x2 (1,2)(2,1)
# k=3일때, (3,0,0)x3 (0,1,2)x6 (1,1,1)
# k=4일떄, (3,0,0,0) 너무 많음 pass
# n=4, k=2일떄, (4,0)x2 (2,2) (1,3)(3,1)
# k=3일떄, (4,0,0)x3 (3,1,0)x6 (2,1,1)x3 (0,2,2)x3
# 점화식 : DP[i][j] = DP[i-1][j] + DP[i][j-1]

n, k = map(int, input().split())
DP = list([0] * n for _ in range(k))
DP[0][0] = 1
for i in range(k):
    for j in range(n):
        if i == 0:
            DP[i][j] = 1
        elif j == 0:
            DP[i][j] = i + 1
        else:
            DP[i][j] = DP[i-1][j] + DP[i][j-1]
print(DP[k-1][n-1] % 1000000000)